## 1. Use the pydataset module to load the iris data set into a dataframe, df_iris

In [45]:
from pydataset import data

import pandas as pd
import numpy as np

In [2]:
df_iris = data('iris')

In [3]:
# print the first 3 rows
print(df_iris.head(3))

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [4]:
# print the number of rows and columns (shape)
print(df_iris.shape)

(150, 5)

In [5]:
# print the column names
[print(col) for col in df_iris]

Sepal.Length
Sepal.Width
Petal.Length
Petal.Width
Species

[None, None, None, None, None]

In [46]:
df_iris.columns = [col.lower().replace('.','_') for col in df_iris]

In [47]:
# print the data type of each column
print(df_iris.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB
None

In [7]:
# print the summary statistics for each of the numeric variables. 
# Would you recommend rescaling the data based on these statistics?
print(df_iris.describe())

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [8]:
#

In [9]:
df_excel = pd.read_excel('Excel_Stats.xlsx', sheet_name = 'Data')

In [10]:
df_excel_sample = df_excel.head(100)
print(df_excel.shape[0])

7043

In [11]:
df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,tenure,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0017-IUDMW,Female,0,Yes,Yes,72,2,2,2,Credit card (automatic),116.80,8456.75,No
1,0019-EFAEP,Female,0,No,No,72,2,2,2,Bank transfer (automatic),101.30,7261.25,No
2,0078-XZMHT,Male,0,Yes,No,72,2,1,2,Bank transfer (automatic),85.15,6316.20,No
3,0129-KPTWJ,Male,0,Yes,No,72,1,2,0,Electronic check,94.65,6747.35,No
4,0164-APGRB,Female,0,No,No,72,2,2,2,Electronic check,114.90,8496.70,No

In [12]:
i = 0
for col in (df_excel):
    if i <= 5:
        print(col)
    i += 1

customer_id
gender
is_senior_citizen
partner
dependents
tenure

In [13]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 13 columns):
customer_id          7043 non-null object
gender               7043 non-null object
is_senior_citizen    7043 non-null int64
partner              7043 non-null object
dependents           7043 non-null object
tenure               7043 non-null int64
phone_service        7043 non-null int64
internet_service     7043 non-null int64
contract_type        7043 non-null int64
payment_type         7043 non-null object
monthly_charges      7043 non-null float64
total_charges        7032 non-null float64
churn                7043 non-null object
dtypes: float64(2), int64(5), object(6)
memory usage: 715.4+ KB

In [48]:
df_excel.select_dtypes(include='object').columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [52]:
# for col in df_excel[df_excel.select_dtypes(include=['float', 'int']):
#     r = df[col].max()-df[col].min()
#     print(r)
df_excel[df_excel.select_dtypes('number').columns].apply(lambda s: s.max() - s.min())

is_senior_citizen       1.0
tenure                 72.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
dtype: float64

In [15]:
df_excel.describe()

,is_senior_citizen,tenure,phone_service,internet_service,contract_type,monthly_charges,total_charges
count,7043.000000,7043.000000,7043.000000,7043.000000,7043.000000,7043.000000,7032.000000
mean,0.162147,32.371149,1.325004,1.222916,0.690473,64.761692,2283.300441
std,0.368612,24.559481,0.642730,0.778877,0.833755,30.090047,2266.771362
min,0.000000,0.000000,0.000000,0.000000,0.000000,18.250000,18.800000
25%,0.000000,9.000000,1.000000,1.000000,0.000000,35.500000,401.450000
50%,0.000000,29.000000,1.000000,1.000000,0.000000,70.350000,1397.475000
75%,0.000000,55.000000,2.000000,2.000000,1.000000,89.850000,3794.737500
max,1.000000,72.000000,2.000000,2.000000,2.000000,118.750000,8684.800000

In [16]:
# summary = df_excel.describe()
# summary['range'] = summary.loc('max')-summary.loc('min')

## 3. Read train.csv from google drive (shared through classroom in topic 'Classification') into a dataframe labeled df_google

In [17]:
# sheet_url = 'https://docs.google.com/spreadsheets/d/1FeU5EJxywoLCXO8jitmqVQPm5qL5n9qaq8BTtEoawuw/edit#gid=0'    

# csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

# df_google = pd.read_csv(csv_export_url)
# df_google.head()

df_google = pd.read_csv('train.csv')

In [18]:
df_google.head(3)

,rowid,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
0,1,2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1
1,2,2015-02-04 17:51:59,23.15,27.2675,429.5,714.00,0.004783,1
2,3,2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1

In [19]:
df_google.shape

(8143, 8)

In [20]:
[print(col) for col in df_google]

rowid
date
Temperature
Humidity
Light
CO2
HumidityRatio
Occupancy

[None, None, None, None, None, None, None, None]

In [21]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8143 entries, 0 to 8142
Data columns (total 8 columns):
rowid            8143 non-null int64
date             8143 non-null object
Temperature      8143 non-null float64
Humidity         8143 non-null float64
Light            8143 non-null float64
CO2              8143 non-null float64
HumidityRatio    8143 non-null float64
Occupancy        8143 non-null int64
dtypes: float64(5), int64(2), object(1)
memory usage: 509.0+ KB

In [22]:
df_google.describe()

,rowid,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
count,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000
mean,4072.000000,20.619084,25.731507,119.519375,606.546243,0.003863,0.212330
std,2350.825954,1.016916,5.531211,194.755805,314.320877,0.000852,0.408982
min,1.000000,19.000000,16.745000,0.000000,412.750000,0.002674,0.000000
25%,2036.500000,19.700000,20.200000,0.000000,439.000000,0.003078,0.000000
50%,4072.000000,20.390000,26.222500,0.000000,453.500000,0.003801,0.000000
75%,6107.500000,21.390000,30.533333,256.375000,638.833333,0.004352,0.000000
max,8143.000000,23.180000,39.117500,1546.333333,2028.500000,0.006476,1.000000

In [57]:
df_google.Occupancy.unique()

array([1, 0])

In [23]:
df_csv = pd.read_csv('titanic.csv')

In [24]:
df_csv.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [25]:
df_csv.tail()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
886,886,0,2,male,27.0,0,0,13.00,S,Second,NaN,Southampton,1
887,887,1,1,female,19.0,0,0,30.00,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.45,S,Third,NaN,Southampton,0
889,889,1,1,male,26.0,0,0,30.00,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.75,Q,Third,NaN,Queenstown,1

In [26]:
print(df_csv.shape)

(891, 13)

In [27]:
[print(col) for col in df_csv]

passenger_id
survived
pclass
sex
age
sibsp
parch
fare
embarked
class
deck
embark_town
alone

[None, None, None, None, None, None, None, None, None, None, None, None, None]

In [28]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
passenger_id    891 non-null int64
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             714 non-null float64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        889 non-null object
class           891 non-null object
deck            203 non-null object
embark_town     889 non-null object
alone           891 non-null int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [29]:
df_csv.describe()

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.602694
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.489615
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [67]:
for col in df_csv.drop(['passenger_id', 'age', 'fare'], axis=1):
        print(f'{col}: {df_csv[col].value_counts.unique()}')

AttributeError: 'function' object has no attribute 'unique'

In [70]:
cols = ["survived", "pclass", "sibsp", "parch", "embarked", "class", "deck", "alone"]
for col in cols:
    print(f"{col:>10}: {', '.join(pd.Series(df_csv[col].value_counts().index.values).astype(str).unique()[:5])}")

  survived: 0, 1
    pclass: 3, 1, 2
     sibsp: 0, 1, 2, 4, 3
     parch: 0, 1, 2, 5, 3
  embarked: S, C, Q
     class: Third, First, Second
      deck: C, B, D, E, A
     alone: 1, 0